tutorials/verification/baseCaseMass_local/0.org/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     1.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 101325;

boundaryField
{
    inlet
    {
        type            zeroGradient;
    }
    outlet
    {
        type            totalPressure;
        p0              $internalField;
        value           $internalField;
    
        U               U;
        phi             phi;
    }
    sides
    {
        type    zeroGradient;
    }
    sphere
    {
        type    totalPressure;
        p0      uniform 101325;
        value   uniform 101325;
    
        U       U;
        phi     phi;
    }
}

// ************************************************************************* //
